; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v10)
             (pred_4 ?v13 ?v4)
             (pred_9 ?v8 ?v4)
             (pred_7 ?v9 ?v8 )
	     (pred_1 ?v8)
             (pred_8 ?v2)
             (pred_10 ?v13)
             (pred_11 ?v4)
             (pred_12 ?v8)
             (pred_6 ?v13)
             (pred_5 ?v8)
             (pred_3 ))



(:action op_4
:parameters (?v11 ?v7 ?v3 ?v1)
:precondition (and (pred_8 ?v11) (pred_8 ?v7) (pred_10 ?v3) (pred_11 ?v1)
          (pred_2 ?v11 ?v7) (pred_4 ?v3 ?v1)
                   (pred_9 ?v7 ?v1) (pred_1 ?v11) 
                   (pred_12 ?v7) (pred_6 ?v3))
:effect (and  (pred_5 ?v7) (not (pred_12 ?v7))))


(:action op_5
:parameters (?v11 ?v12)
:precondition (and (pred_8 ?v11) (pred_8 ?v12)
               (pred_1 ?v11) (pred_2 ?v11 ?v12) (pred_5 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v11))))

(:action op_1
:parameters (?v11 ?v3)
:precondition (and (pred_8 ?v11) (pred_10 ?v3) 
                  (pred_1 ?v11) (pred_7 ?v3 ?v11) (pred_3 ))
:effect (and (pred_6 ?v3)
   (not (pred_7 ?v3 ?v11)) (not (pred_3 ))))


(:action op_2
:parameters (?v11 ?v5 ?v6)
:precondition (and (pred_8 ?v11) (pred_10 ?v5) (pred_10 ?v6)
                  (pred_1 ?v11) (pred_6 ?v6) (pred_7 ?v5 ?v11))
:effect (and (pred_6 ?v5) (pred_7 ?v6 ?v11)
        (not (pred_6 ?v6)) (not (pred_7 ?v5 ?v11))))

(:action op_3
:parameters (?v11 ?v3)
:precondition (and (pred_8 ?v11) (pred_10 ?v3) 
                  (pred_1 ?v11) (pred_6 ?v3))
:effect (and (pred_3 ) (pred_7 ?v3 ?v11) (not (pred_6 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_18 obj_16 obj_14 obj_19 obj_08 obj_13 obj_04 obj_06 obj_15 obj_12 obj_05 obj_01 obj_21 obj_20 obj_07
    obj_17 obj_02
    obj_09 obj_03 obj_10
    )

    (:init
       (pred_3)

       (pred_8 obj_11)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_08)
       (pred_8 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_06)
       (pred_8 obj_15)
       (pred_8 obj_12)
       (pred_8 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_21)
       (pred_8 obj_20)
       (pred_8 obj_07)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_10)

       (pred_2 obj_11 obj_19)
       (pred_2 obj_11 obj_18)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_16)
       (pred_2 obj_18 obj_11)
       (pred_2 obj_16 obj_13)
       (pred_2 obj_16 obj_14)
       (pred_2 obj_16 obj_18)
       (pred_2 obj_14 obj_04)
       (pred_2 obj_14 obj_16)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_11)
       (pred_2 obj_08 obj_15)
       (pred_2 obj_08 obj_13)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_13 obj_12)
       (pred_2 obj_13 obj_04)
       (pred_2 obj_13 obj_16)
       (pred_2 obj_13 obj_08)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_14)
       (pred_2 obj_04 obj_13)
       (pred_2 obj_06 obj_01)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_15 obj_21)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_08)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_05)
       (pred_2 obj_12 obj_13)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_05 obj_07)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_12)
       (pred_2 obj_01 obj_21)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_15)
       (pred_2 obj_21 obj_01)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_07 obj_05)
       (pred_2 obj_07 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_20)
       (pred_12 obj_11)
       (pred_9  obj_07 obj_17)
       (pred_9  obj_20 obj_02)
       (pred_9  obj_11 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_04)
       (pred_5 obj_06)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_05)
       (pred_5 obj_01)
       (pred_5 obj_21)

       (pred_4  obj_09 obj_17)
       (pred_4  obj_03 obj_02)
       (pred_4  obj_10 obj_02)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_10 obj_07)
       (pred_1 obj_08)
    )

    (:goal (and
       (pred_7 obj_09 obj_15)
       (pred_7 obj_03 obj_05)
    ))
(:constraints
  (always (not (pred_1 obj_04)))
)
)

; plan
1. (op_1 obj_08 obj_03)
   deleted: (pred_7 obj_03 obj_08) (pred_3)
   added: (pred_6 obj_03)
   goals met: 0 of 2
2. (op_5 obj_08 obj_13)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_13)
   goals met: 0 of 2
3. (op_5 obj_13 obj_12)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_12)
   goals met: 0 of 2
4. (op_5 obj_12 obj_05)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_05)
   goals met: 0 of 2
5. (op_3 obj_05 obj_03)
   deleted: (pred_6 obj_03)
   added: (pred_3) (pred_7 obj_03 obj_05)
   goals met: 1 of 2
6. (op_5 obj_05 obj_12)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_12)
   goals met: 1 of 2
7. (op_5 obj_12 obj_13)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_13)
   goals met: 1 of 2
8. (op_5 obj_13 obj_16)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_16)
   goals met: 1 of 2
9. (op_1 obj_16 obj_09)
   deleted: (pred_7 obj_09 obj_16) (pred_3)
   added: (pred_6 obj_09)
   goals met: 1 of 2
10. (op_5 obj_16 obj_18)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_18)
   goals met: 1 of 2
11. (op_5 obj_18 obj_08)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_08)
   goals met: 1 of 2
12. (op_5 obj_08 obj_15)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_15)
   goals met: 1 of 2
13. (op_3 obj_15 obj_09)
   deleted: (pred_6 obj_09)
   added: (pred_3) (pred_7 obj_09 obj_15)
   goals met: 2 of 2
